; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v7)
		(pred_6 ?v2)
		(pred_4 ?v1)
		(pred_5 ?v1)
		(pred_1 ?v2 ?v1)
		(pred_3)
		(pred_2 ?v2))

   (:action op_2
       :parameters  (?v3 ?v8)
       :precondition (and (not-eq ?v3 ?v8) 
                          (pred_4 ?v3) (pred_4 ?v8) (pred_5 ?v3))
       :effect (and  (pred_5 ?v8)
		     (not (pred_5 ?v3))))


   (:action op_3
       :parameters (?v6 ?v5)
       :precondition  (and  (pred_6 ?v6) (pred_4 ?v5)
			    (pred_1 ?v6 ?v5) (pred_5 ?v5) (pred_3))
       :effect (and (pred_2 ?v6)
		    (not (pred_1 ?v6 ?v5)) 
		    (not (pred_3))))

   (:action op_1
       :parameters  (?v6  ?v5)
       :precondition  (and  (pred_6 ?v6) (pred_4 ?v5)
			    (pred_2 ?v6) (pred_5 ?v5))
       :effect (and (pred_1 ?v6 ?v5)
		    (pred_3)
		    (not (pred_2 ?v6)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_02 obj_03 obj_01 
          obj_06 obj_04 obj_05 
)
(:init
(pred_4 obj_02)
(pred_4 obj_03)
(pred_4 obj_01)
(pred_6 obj_06)
(pred_6 obj_04)
(pred_6 obj_05)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(pred_3)
(pred_1 obj_06 obj_02)
(pred_1 obj_04 obj_03)
(pred_1 obj_05 obj_02)
(pred_5 obj_02)
)
(:goal
(and
(pred_1 obj_06 obj_01)
(pred_1 obj_04 obj_03)
(pred_1 obj_05 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_06 obj_01) (pred_5 obj_03))
    (sometime-before  (pred_1 obj_05 obj_01) (pred_5 obj_03))
  )
)
)

; plan
1. (op_3 obj_06 obj_02)
   deleted: (pred_1 obj_06 obj_02) (pred_3)
   added: (pred_2 obj_06)
   goals met: 1 of 3
2. (op_2 obj_02 obj_03)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_03)
   goals met: 1 of 3
3. (op_1 obj_06 obj_03)
   deleted: (pred_2 obj_06)
   added: (pred_1 obj_06 obj_03) (pred_3)
   goals met: 1 of 3
4. (op_2 obj_03 obj_02)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_02)
   goals met: 1 of 3
5. (op_3 obj_05 obj_02)
   deleted: (pred_1 obj_05 obj_02) (pred_3)
   added: (pred_2 obj_05)
   goals met: 1 of 3
6. (op_2 obj_02 obj_01)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_01)
   goals met: 1 of 3
7. (op_1 obj_05 obj_01)
   deleted: (pred_2 obj_05)
   added: (pred_1 obj_05 obj_01) (pred_3)
   goals met: 2 of 3
8. (op_2 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_03)
   goals met: 2 of 3
9. (op_3 obj_06 obj_03)
   deleted: (pred_1 obj_06 obj_03) (pred_3)
   added: (pred_2 obj_06)
   goals met: 2 of 3
10. (op_2 obj_03 obj_01)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_01)
   goals met: 2 of 3
11. (op_1 obj_06 obj_01)
   deleted: (pred_2 obj_06)
   added: (pred_1 obj_06 obj_01) (pred_3)
   goals met: 3 of 3
